<?xml version="1.0" ?>
<net name="deeplab_mobilenet" version="10">
	<layers>
		<layer id="0" name="Resize_486/axis459319289" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Resize_486/Add_input_port_1/value459719055" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="1337" type="Const" version="opset1">
			<data offset="20" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64" names="1337">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="decoder.last_conv.8.weight" type="Const" version="opset1">
			<data offset="36" size="2048" shape="2,256,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="decoder.last_conv.8.weight">
					<dim>2</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="1247" type="Const" version="opset1">
			<data offset="2084" size="2359296" shape="256,256,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1247">
					<dim>256</dim>
					<dim>256</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="1244" type="Const" version="opset1">
			<data offset="2361380" size="2801664" shape="256,304,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1244">
					<dim>256</dim>
					<dim>304</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="1241" type="Const" version="opset1">
			<data offset="5163044" size="4608" shape="48,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1241">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="1085" type="Const" version="opset1">
			<data offset="5167652" size="9216" shape="24,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1085">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1079" type="Const" version="opset1">
			<data offset="5176868" size="6144" shape="96,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1079">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="1076" type="Const" version="opset1">
			<data offset="5183012" size="2048" shape="16,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1076">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="input.1" type="Parameter" version="opset1">
			<data shape="1,3,288,480" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="1070" type="Const" version="opset1">
			<data offset="5185060" size="3456" shape="32,3,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1070">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>288</dim>
					<dim>480</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_0/Dims5706" type="Const" version="opset1">
			<data offset="5188516" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1069">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Clip_3" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="367">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="1073" type="Const" version="opset1">
			<data offset="5188644" size="1152" shape="32,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1073">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_19/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_19/Dims5496" type="Const" version="opset1">
			<data offset="5189796" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1072">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Clip_22" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="396">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_23/Dims5574" type="Const" version="opset1">
			<data offset="5189924" size="64" shape="1,16,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1075">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_39/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>144</dim>
					<dim>240</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Conv_39/Dims5748" type="Const" version="opset1">
			<data offset="5189988" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_39" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1078">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Clip_42" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="427">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="1082" type="Const" version="opset1">
			<data offset="5190372" size="3456" shape="96,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1082">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_43/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>146</dim>
					<dim>242</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_43/Dims5682" type="Const" version="opset1">
			<data offset="5193828" size="384" shape="1,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1081">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Clip_46" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="432">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_47/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_47/Dims5484" type="Const" version="opset1">
			<data offset="5194212" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Conv_47" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1084">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="1094" type="Const" version="opset1">
			<data offset="5194308" size="13824" shape="24,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1094">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="1088" type="Const" version="opset1">
			<data offset="5208132" size="13824" shape="144,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1088">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_63/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_63/Dims5772" type="Const" version="opset1">
			<data offset="5221956" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_63" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1087">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Clip_66" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="463">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="1091" type="Const" version="opset1">
			<data offset="5222532" size="5184" shape="144,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1091">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Conv_67/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_67/Dims5640" type="Const" version="opset1">
			<data offset="5227716" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_67" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1090">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Clip_70" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="468">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Conv_71/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>24</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Conv_71/Dims5616" type="Const" version="opset1">
			<data offset="5228292" size="96" shape="1,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_71" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1093">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Add_72" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="471">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_451/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Conv_451/Dims5502" type="Const" version="opset1">
			<data offset="5228388" size="192" shape="1,48,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_451" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1240">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Relu_452" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="1026">
					<dim>1</dim>
					<dim>48</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Resize_471/axis456119013" type="Const" version="opset1">
			<data offset="0" size="16" shape="2" element_type="i64"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Resize_471/Add_input_port_1/value456519283" type="Const" version="opset1">
			<data offset="16" size="4" shape="1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="1238" type="Const" version="opset1">
			<data offset="5228580" size="1310720" shape="256,1280,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1238">
					<dim>256</dim>
					<dim>1280</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1223" type="Const" version="opset1">
			<data offset="6539300" size="327680" shape="256,320,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1223">
					<dim>256</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="1220" type="Const" version="opset1">
			<data offset="6866980" size="1228800" shape="320,960,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1220">
					<dim>320</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="1214" type="Const" version="opset1">
			<data offset="8095780" size="614400" shape="960,160,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1214">
					<dim>960</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="1202" type="Const" version="opset1">
			<data offset="8710180" size="614400" shape="160,960,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1202">
					<dim>160</dim>
					<dim>960</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1196" type="Const" version="opset1">
			<data offset="9324580" size="614400" shape="960,160,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1196">
					<dim>960</dim>
					<dim>160</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="1193" type="Const" version="opset1">
			<data offset="9938980" size="368640" shape="160,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1193">
					<dim>160</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="1187" type="Const" version="opset1">
			<data offset="10307620" size="221184" shape="576,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1187">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="1175" type="Const" version="opset1">
			<data offset="10528804" size="221184" shape="96,576,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1175">
					<dim>96</dim>
					<dim>576</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="1169" type="Const" version="opset1">
			<data offset="10749988" size="221184" shape="576,96,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1169">
					<dim>576</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1166" type="Const" version="opset1">
			<data offset="10971172" size="147456" shape="96,384,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1166">
					<dim>96</dim>
					<dim>384</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="1160" type="Const" version="opset1">
			<data offset="11118628" size="98304" shape="384,64,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1160">
					<dim>384</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="1130" type="Const" version="opset1">
			<data offset="11216932" size="49152" shape="64,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1130">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="1124" type="Const" version="opset1">
			<data offset="11266084" size="24576" shape="192,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1124">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="1112" type="Const" version="opset1">
			<data offset="11290660" size="24576" shape="32,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1112">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="1106" type="Const" version="opset1">
			<data offset="11315236" size="24576" shape="192,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1106">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="1103" type="Const" version="opset1">
			<data offset="11339812" size="18432" shape="32,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1103">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="1097" type="Const" version="opset1">
			<data offset="11358244" size="13824" shape="144,24,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1097">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_88/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>24</dim>
					<dim>72</dim>
					<dim>120</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_88/Dims5544" type="Const" version="opset1">
			<data offset="11372068" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_88" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1096">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Clip_91" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="500">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="1100" type="Const" version="opset1">
			<data offset="11372644" size="5184" shape="144,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1100">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_92/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>74</dim>
					<dim>122</dim>
				</port>
				<port id="1">
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_92/Dims5598" type="Const" version="opset1">
			<data offset="11377828" size="576" shape="1,144,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_92" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1099">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Clip_95" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="505">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_96/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>144</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>144</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_96/Dims5760" type="Const" version="opset1">
			<data offset="11378404" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_96" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1102">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_112/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_112/Dims5568" type="Const" version="opset1">
			<data offset="11378532" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_112" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1105">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Clip_115" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="536">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="1109" type="Const" version="opset1">
			<data offset="11379300" size="6912" shape="192,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1109">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_116/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_116/Dims5826" type="Const" version="opset1">
			<data offset="11386212" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_116" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1108">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Clip_119" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="541">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_120/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_120/Dims5712" type="Const" version="opset1">
			<data offset="11386980" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_120" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1111">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Add_121" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="544">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="1121" type="Const" version="opset1">
			<data offset="11387108" size="24576" shape="32,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1121">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="1115" type="Const" version="opset1">
			<data offset="11411684" size="24576" shape="192,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1115">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_137/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_137/Dims5526" type="Const" version="opset1">
			<data offset="11436260" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_137" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1114">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Clip_140" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="573">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="1118" type="Const" version="opset1">
			<data offset="11437028" size="6912" shape="192,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1118">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_141/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_141/Dims5718" type="Const" version="opset1">
			<data offset="11443940" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_141" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1117">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Clip_144" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="578">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_145/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Conv_145/Dims5676" type="Const" version="opset1">
			<data offset="11444708" size="128" shape="1,32,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_145" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1120">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Add_146" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="581">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_162/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="1,1" pads_end="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>36</dim>
					<dim>60</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Conv_162/Dims5646" type="Const" version="opset1">
			<data offset="11444836" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_162" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1123">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Clip_165" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="610">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="1127" type="Const" version="opset1">
			<data offset="11445604" size="6912" shape="192,1,1,3,3" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="1127">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_166/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" strides="2,2" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>38</dim>
					<dim>62</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Conv_166/Dims5670" type="Const" version="opset1">
			<data offset="11452516" size="768" shape="1,192,1,1" element_type="f32"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_166" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="1126">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Clip_169" type="Clamp" version="opset1">
			<data max="6.0" min="0.0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="615">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_170/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" strides="1,1" dilations="1,1" pads_begin="0,0" pads_end="0,0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>30</dim>
				</port>
				<port id="1">
